# Data Frame Indexing

In [22]:
import numpy as np

In [23]:
import pandas as pd

arr = np.arange(1,21).reshape(5,4)
asdads

In [24]:
arr

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20]])

In [25]:
arr2 = pd.DataFrame(data=arr, index=['Ali', 'Veli', 'Ayşe', 'Aslı', 'Kemal'], columns=['Yas', 'Kilo', 'Boy', 'Cinsiyet'])

In [27]:
arr2

       Yas  Kilo  Boy  Cinsiyet
Ali      1     2    3         4
Veli     5     6    7         8
Ayşe     9    10   11        12
Aslı    13    14   15        16
Kemal   17    18   19        20

### Yeni Bir Column Eklemek Istersek;

In [53]:
arr2['Plaka Kodu'] = arr2['Yas'] + arr2['Yas']

In [54]:
arr2

       Yas  Kilo  Boy  Cinsiyet  Plaka Kodu
Ali      1     2    3         4           2
Veli     5     6    7         8          10
Ayşe     9    10   11        12          18
Aslı    13    14   15        16          26
Kemal   17    18   19        20          34

### Column Silmek Istersek;

axis=1 ile column'u belirttik, inplace(yerinde) ilede yapilan degisikligi yerinde yapmasini vurguladik. Yapmasaydik alternatifi su sekildi;            
arr2 = arr2.drop('Plaka Kodu', axis=1)

In [55]:
arr2.drop('Plaka Kodu', axis=1, inplace=True)

In [56]:
arr2

       Yas  Kilo  Boy  Cinsiyet
Ali      1     2    3         4
Veli     5     6    7         8
Ayşe     9    10   11        12
Aslı    13    14   15        16
Kemal   17    18   19        20

### Tablodaki verilere tek tek ulasmak istersek peki;

In [58]:
arr2.loc['Ali']['Boy']

3

In [60]:
arr2.loc['Aslı','Yas']

13

In [59]:
arr2.iloc[2][2]

11

In [61]:
arr2

       Yas  Kilo  Boy  Cinsiyet
Ali      1     2    3         4
Veli     5     6    7         8
Ayşe     9    10   11        12
Aslı    13    14   15        16
Kemal   17    18   19        20

### Conditional Yazarsak;

In [63]:
arr2 < 10

         Yas   Kilo    Boy  Cinsiyet
Ali     True   True   True      True
Veli    True   True   True      True
Ayşe    True  False  False     False
Aslı   False  False  False     False
Kemal  False  False  False     False

arr2 tablosundaki 10'dan kucuk degerleri NaN olarak getirdi.

In [67]:
arr2[arr2 < 10]

       Yas  Kilo  Boy  Cinsiyet
Ali    1.0   2.0  3.0       4.0
Veli   5.0   6.0  7.0       8.0
Ayşe   9.0   NaN  NaN       NaN
Aslı   NaN   NaN  NaN       NaN
Kemal  NaN   NaN  NaN       NaN

arr2 tablosundan Yas Column'u 10'dan kucuk olanlari getirdi.

In [70]:
arr2[arr2['Yas'] < 10]

      Yas  Kilo  Boy  Cinsiyet
Ali     1     2    3         4
Veli    5     6    7         8
Ayşe    9    10   11        12